Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Инструменты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	// 1. Проверка по UID
	Если ЗначениеЗаполнено(UID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.Инструменты
		|ГДЕ
		|	UID = &UID
		|	И Ссылка <> &ТекущаяСсылка";
		
		Запрос.УстановитьПараметр("UID", UID);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Инструмент с таким UID уже существует", Выборка.Ссылка);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	// 2. Проверка по Тикер + classCode (если UID пуст)
	Если //НЕ ЗначениеЗаполнено(UID)
	   //И 
	   ЗначениеЗаполнено(Тикер)
	   И ЗначениеЗаполнено(ClassCode) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.Инструменты
		|ГДЕ
		|	Тикер = &Тикер
		|	И ClassCode = &ClassCode
		|	И Ссылка <> &ТекущаяСсылка";
		
		Запрос.УстановитьПараметр("Тикер", Тикер);
		Запрос.УстановитьПараметр("ClassCode", ClassCode);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Инструмент с таким тикером и рынком уже существует", Выборка.Ссылка);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
